Rework to use objectstore
